



* 1.39

#+BEGIN_SRC scheme :session 

(define (cont-frac n d k)
  (define (cont-frac-iter i result)
    (if (i = 0)
        (/ (n i) (+ (d i) result))
        (cont-frac-iter (- i 1)
                        (/ (n i) (+ (d i) result)))))
  (cont-frac-iter k 0.0))
#+END_SRC

#+RESULTS:

#+BEGIN_SRC scheme :session

(define (tan-cf x k)
  (cont-frac-iter (lambda (i) 
                    (if (= i 1) x (- (square x))))
                  (lambda (i) 
                    (- (* 2 i) 1))
                  k))

(define (square x) (* x x))
#+END_SRC

#+RESULTS:


#+BEGIN_SRC scheme :session 
(tan-cf 20 10)
#+END_SRC

#+RESULTS:
: 142873287260/419978591963
